Repository: FayazAhmedLaghari/MediRemind---Medicine-Reminder-App
Catalog: lib/l10n/app_*.arb
Languages: sd, ur

# appName
source: MediRemind
sd: ميڈي ريمائنڈ

source: Welcome Back
sd: واپس خوش آمديد
ur: خوش آمدید

source: Log In
sd: داخل ٿيو
ur: لاگ ان

# email
source: Enter your Email
sd: پنھنجو اي ميل درج ڪريو
ur: اپنا ای میل درج کریں

# password
source: Enter your Password
sd: پاس ورڊ درج ڪريو
ur: اپنا پاسورڈ درج کریں

source: Forgot Password?
sd: پاس ورڊ وسري ويا؟
ur: پاسورڈ بھول گئے؟

source: Create Account
sd: اڪاؤنٽ بنايو
ur: اکاؤنٹ بنائیں

# dashboardTitle
source: Patient Dashboard
sd: مريض ڊيش بورڊ
ur: مریض ڈیش بورڈ

source: My Medicines
sd: منهنجيون دوائيون
ur: میری دوائیں

source: Scan Prescription
sd: نسخو اسڪين ڪريو
ur: نسخہ اسکین کریں

source: Reminders
sd: ياددهاني
ur: یاد دہانیاں

source: Profile
sd: پروفائل
ur: پروفائل

source: Logout
sd: لاگ آؤٽ
ur: لاگ آؤٹ

source: Confirm Logout
sd: لاگ آؤٽ جي تصديق ڪريو
ur: لاگ آؤٹ کی تصدیق

# logoutConfirmation
source: Are you sure you want to logout?
sd: ڇا توھان يقيني طور تي لاگ آؤٽ ڪرڻ چاھيو ٿا؟
ur: کیا آپ واقعی لاگ آؤٹ کرنا چاہتے ہیں؟

source: Cancel
sd: منسوخ ڪريو
ur: منسوخ کریں

source: Delete
sd: حذف ڪريو
ur: خارج کریں

source: Add Reminder
sd: ياددهاني شامل ڪريو
ur: یاد دہانی شامل کریں

source: Medicine Name
sd: دوا جو نام
ur: دوا کا نام

source: Dosage
sd: خوراڪ
ur: خوراک

source: Frequency
sd: تعدد
ur: تعدد

source: Time
sd: وقت
ur: وقت

source: Notes
sd: نوٽس
ur: نوٹس

source: Save
sd: محفوظ ڪريو
ur: محفوظ کریں

source: Edit
sd: ترميم ڪريو
ur: ترمیم کریں

source: Delete Medicine?
sd: دوا حذف ڪريو؟
ur: دوا حذف کریں؟

# deleteConfirmation
source: Are you sure you want to delete {medicineName}?
sd: ڇا توھان {medicineName} کي حذف ڪرڻ چاھيو ٿا؟
ur: کیا آپ واقعی {medicineName} کو حذف کرنا چاہتے ہیں؟

source: Dark Mode
sd: ڊارڪ موڊ
ur: ڈارک موڈ

source: Light Mode
sd: روشني موڊ
ur: لائٹ موڈ

# medicineInteraction
source: Potential interaction with another medicine
sd: ٻي دوا سان ممڪنہ تعامل
ur: ممکنہ تعامل دوسری دوا کے ساتھ

# refillReminder
source: Refill reminder: Check supply level
sd: ريفل ياددهاني: سپلائي سطح چيڪ ڪريو
ur: ری فل یاددہانی: مقدار چیک کریں

# noMedicines
source: No Medicines Yet
sd: هنوز ڪوئي دوائيون نہيون
ur: کوئی دوائیں نہیں

# addFirstMedicine
source: Add your first medicine to get started
sd: شروع ڪرڻ لاء پنھنجي پهريون دوا شامل ڪريو
ur: شروع کرنے کے لیے اپنی پہلی دوا شامل کریں

# noReminders
source: No reminders for this day
sd: هن ڏينهن لاء ڪوئي ياددهاني نہيون
ur: اس دن کے لیے کوئی یاددہانی نہیں

source: Mark Done
sd: مڪمل نشان زد ڪريو
ur: مکمل نشان کریں

source: Calendar
sd: ڪيلنڈر
ur: کلینڈر

source: Today
sd: اڄ
ur: آج

# medicineAdded
source: Medicine added successfully
sd: دوا ڪاميابي سان شامل ڪيو
ur: دوا کامیابی سے شامل ہو گئی

# reminderAdded
source: Reminder added successfully
sd: ياددهاني ڪاميابي سان شامل ڪيو
ur: یاد دہانی کامیابی سے شامل ہو گئی

# markedCompleted
source: Marked as completed
sd: مڪمل نشان زد
ur: مکمل کے طور پر نشان لگا دیا گیا

source: Medicine deleted
sd: دوا حذف ڪيو
ur: دوا حذف ہو گئی

# loggedOut
source: Logged out successfully
sd: ڪامياب طريقي سان لاگ آؤٽ
ur: کامیابی کے ساتھ لاگ آؤٹ ہوگیا

source: Login failed
sd: لاگ ان ناڪام
ur: لاگ ان ناکام

source: Register
sd: رجسٽر ڪريو
ur: رجسٹر

source: Name
sd: نام
ur: نام

source: Age
sd: عمر
ur: عمر

source: Gender
sd: صنف
ur: صنف

source: Medical History
sd: طبي سوانح
ur: طبی تاریخ

source: Repeat Password
sd: پاس ورڊ دوبارہ ڪريو
ur: پاسورڈ دوبارہ درج کریں

# alreadyHaveAccount
source: Already have an account?
sd: پھريون ئي اڪاؤنٽ آهي؟
ur: کیا آپ کا پہلے سے اکاؤنٹ ہے؟

source: Sign In
sd: داخل ٿيو
ur: سائن ان

source: Sign Up
sd: سائن اپ ڪريو
ur: سائن اپ

source: Select Medicine
sd: دوا منتخب ڪريو
ur: دوا منتخب کریں

source: Reminder Time
sd: ياددهاني وقت
ur: یاد دہانی کا وقت

source: Select time
sd: وقت منتخب ڪريو
ur: وقت منتخب کریں

# medicineInteractionsTitle
source: Medicine Interactions
sd: دوا تعامل
ur: دوا کے تعاملات

# refillRemindersTitle
source: Refill Reminders
sd: ريفل ياددهاني
ur: ری فل یاد دہانیاں

# interactionsFound
source: Interactions found: {count}
sd: تعامل مليا: {count}
ur: تعلقات ملے: {count}

# refillsNeeded
source: Refills needed: {count}
sd: ريفل جي ضرورت: {count}
ur: درکار ری فل: {count}
